saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.LPC54102_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.0.1" condition="device.LPC54102_AND_driver.common">
      <description>Reset Driver</description>
      <files>
        <file category="header" name="drivers/fsl_reset.h"/>
        <file category="sourceC" name="drivers/fsl_reset.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.LPC54102_AND_device.LPC54102_CMSIS_AND_driver.clock_AND_driver.reset">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC54102" Cversion="1.0.0" condition="device.LPC54102_AND_component.serial_manager_uart_AND_component.vusart_adapter_AND_device.LPC54102_startup_AND_driver.clock_AND_driver.common_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.vusart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="device.LPC54102_AND_CMSIS_Include_core_cm0plus_OR_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="core.cm0p_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54102_cm0plus.s"/>
        <file condition="core.cm4f_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54102_cm4.s"/>
        <file condition="core.cm0p_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC54102_cm0plus.s"/>
        <file condition="core.cm4f_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC54102_cm4.s"/>
        <file condition="core.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm0plus.scf"/>
        <file condition="core.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm0plus.scf"/>
        <file condition="core.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm0plus_ram.scf"/>
        <file condition="core.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm0plus_ram.scf"/>
        <file condition="core.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm4.scf"/>
        <file condition="core.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm4.scf"/>
        <file condition="core.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm4_ram.scf"/>
        <file condition="core.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm4_ram.scf"/>
        <file condition="core.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm0plus.icf"/>
        <file condition="core.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm0plus.icf"/>
        <file condition="core.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm0plus_ram.icf"/>
        <file condition="core.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm0plus_ram.icf"/>
        <file condition="core.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm4.icf"/>
        <file condition="core.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm4.icf"/>
        <file condition="core.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm4_ram.icf"/>
        <file condition="core.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm4_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file condition="core.cm0p" category="header" attr="config" name="LPC54102_cm0plus.h"/>
        <file condition="core.cm0p" category="header" attr="config" name="LPC54102_cm0plus_features.h"/>
        <file condition="core.cm0p" category="sourceC" attr="config" name="system_LPC54102_cm0plus.c"/>
        <file condition="core.cm0p" category="header" attr="config" name="system_LPC54102_cm0plus.h"/>
        <file condition="core.cm4f" category="header" attr="config" name="LPC54102_cm4.h"/>
        <file condition="core.cm4f" category="header" attr="config" name="LPC54102_cm4_features.h"/>
        <file condition="core.cm4f" category="sourceC" attr="config" name="system_LPC54102_cm4.c"/>
        <file condition="core.cm4f" category="header" attr="config" name="system_LPC54102_cm4.h"/>
      </files>
    </component>
  </components>
</package>
